Model: "QML_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
geometry_0 (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
geometry_1 (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
geometry_2 (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
orbital_energies (InputLayer)   [(None, 4)]          0                                            
__________________________________________________________________________________________________
geometry_nn_0 (Dense)           (None, 1)            4           geometry_0[0][0]                 
__________________________________________________________________________________________________
geometry_nn_1 (Dense)           (None, 1)            4           geometry_1[0][0]                 
__________________________________________________________________________________________________
geometry_nn_2 (Dense)           (None, 1)            4           geometry_2[0][0]                 
__________________________________________________________________________________________________
orbital_energy_nn (Dense)       (None, 1)            5           orbital_energies[0][0]           
__________________________________________________________________________________________________
processed_classical_input (Conc (None, 4)            0           geometry_nn_0[0][0]              
                                                                 geometry_nn_1[0][0]              
                                                                 geometry_nn_2[0][0]              
                                                                 orbital_energy_nn[0][0]          
__________________________________________________________________________________________________
quantum_input (InputLayer)      [(None,)]            0                                            
__________________________________________________________________________________________________
controller_nn_0 (Sequential)    (None, 28)           127         processed_classical_input[0][0]  
__________________________________________________________________________________________________
controller_nn_1 (Sequential)    (None, 28)           127         processed_classical_input[0][0]  
__________________________________________________________________________________________________
controller_nn_2 (Sequential)    (None, 28)           127         processed_classical_input[0][0]  
__________________________________________________________________________________________________
pqc0 (ControlledPQC)            (None, 36)           0           quantum_input[0][0]              
                                                                 controller_nn_0[0][0]            
__________________________________________________________________________________________________
pqc1 (ControlledPQC)            (None, 36)           0           quantum_input[0][0]              
                                                                 controller_nn_1[0][0]            
__________________________________________________________________________________________________
pqc2 (ControlledPQC)            (None, 36)           0           quantum_input[0][0]              
                                                                 controller_nn_2[0][0]            
__________________________________________________________________________________________________
readout_concatenate (Concatenat (None, 108)          0           pqc0[0][0]                       
                                                                 pqc1[0][0]                       
                                                                 pqc2[0][0]                       
__________________________________________________________________________________________________
postprocess_input (Concatenate) (None, 112)          0           readout_concatenate[0][0]        
                                                                 processed_classical_input[0][0]  
__________________________________________________________________________________________________
postprocess_nn (Sequential)     (None, 1)            113         postprocess_input[0][0]          
==================================================================================================
Total params: 511
Trainable params: 511
Non-trainable params: 0
__________________________________________________________________________________________________
