Model: "QML_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
geometry_0 (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
geometry_1 (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
geometry_2 (InputLayer)         [(None, 3)]          0                                            
__________________________________________________________________________________________________
geometry_nn_0 (Dense)           (None, 1)            4           geometry_0[0][0]                 
__________________________________________________________________________________________________
geometry_nn_1 (Dense)           (None, 1)            4           geometry_1[0][0]                 
__________________________________________________________________________________________________
geometry_nn_2 (Dense)           (None, 1)            4           geometry_2[0][0]                 
__________________________________________________________________________________________________
processed_geometries (Concatena (None, 3)            0           geometry_nn_0[0][0]              
                                                                 geometry_nn_1[0][0]              
                                                                 geometry_nn_2[0][0]              
__________________________________________________________________________________________________
orbital_energies (InputLayer)   [(None, 4)]          0                                            
__________________________________________________________________________________________________
processed_classical_input (Conc (None, 7)            0           processed_geometries[0][0]       
                                                                 orbital_energies[0][0]           
__________________________________________________________________________________________________
quantum_input (InputLayer)      [(None,)]            0                                            
__________________________________________________________________________________________________
controller_nn_0 (Sequential)    (None, 32)           256         processed_classical_input[0][0]  
__________________________________________________________________________________________________
pqc0 (ControlledPQC)            (None, 8)            0           quantum_input[0][0]              
                                                                 controller_nn_0[1][0]            
__________________________________________________________________________________________________
postprocess_input (Concatenate) (None, 15)           0           pqc0[0][0]                       
                                                                 processed_classical_input[0][0]  
__________________________________________________________________________________________________
postprocess_nn (Sequential)     (None, 1)            16          postprocess_input[0][0]          
==================================================================================================
Total params: 284
Trainable params: 284
Non-trainable params: 0
__________________________________________________________________________________________________
